# Part 3: Regional Performance Insights

#### a) From the List of Orders dataset, identify the top 5 states with the highest order count. For each of these states, calculate the total sales and average profit.

In [1]:
import pandas as pd

In [2]:
order_list_df = pd.read_csv("List_of_Orders_38EF37C2F3.csv")
order_details_df = pd.read_csv("Order_Details_F6D252B2DD.csv")

In [3]:
merged_data = pd.merge(order_details_df , order_list_df , on='Order ID')
merged_data.head()

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,Order Date,CustomerName,State,City
0,B-25601,1275.0,-1148.0,7,Furniture,Bookcases,01-04-2018,Bharat,Gujarat,Ahmedabad
1,B-25601,66.0,-12.0,5,Clothing,Stole,01-04-2018,Bharat,Gujarat,Ahmedabad
2,B-25601,8.0,-2.0,3,Clothing,Hankerchief,01-04-2018,Bharat,Gujarat,Ahmedabad
3,B-25601,80.0,-56.0,4,Electronics,Electronic Games,01-04-2018,Bharat,Gujarat,Ahmedabad
4,B-25602,168.0,-111.0,2,Electronics,Phones,01-04-2018,Pearl,Maharashtra,Pune

In [4]:
state_counts = merged_data.groupby('State')['Order ID'].count().sort_values(ascending=False)
state_counts.head(5)

State
Madhya Pradesh    340
Maharashtra       290
Gujarat            87
Delhi              74
Rajasthan          74
Name: Order ID, dtype: int64

In [ ]:
state_counts = merged_data.groupby('State')['Order ID'].count().sort_values(ascending=False)
top_states = state_counts.head(5).index.tolist()
for state in top_states:
    state_orders = merged_data[merged_data['State'] == state]
    total_sales = state_orders['Amount'].sum()
    avg_profit = state_orders['Profit'].mean()
    print("State: " , state)
    print("Total Sales: " , str(total_sales))
    print("Average Profit: " , str(avg_profit))
    print()

#### b) Highlight any regional disparities in sales or profitability. Suggest regions or cities that should be prioritized for improvement.

##### Let's take example of cities

In [14]:
city_performance = merged_data.groupby('City').agg(
    total_sales=('Amount', 'sum'),
    avg_profit=('Profit', 'mean')
).reset_index()
city_performance.head()

        City  total_sales  avg_profit
0  Ahmedabad      14230.0  -14.193548
1  Allahabad      16857.0  102.700000
2   Amritsar       4507.0   36.266667
3  Bangalore      15058.0   11.944444
4     Bhopal      23583.0   13.196970

In [11]:
negative_profit_cities = city_performance[city_performance['avg_profit'] < 0]
low_sales_cities  = city_performance[city_performance['total_sales'] < city_performance['total_sales'].median()]

In [17]:
negative_profit_cities

         City  total_sales  avg_profit
0   Ahmedabad      14230.0  -14.193548
6     Chennai       6087.0  -88.640000
10  Hyderabad      13256.0  -11.809524
12     Jaipur      10076.0  -17.113636
18      Patna      12943.0   -5.177419

In [15]:
low_sales_cities

        City  total_sales  avg_profit
2   Amritsar       4507.0   36.266667
6    Chennai       6087.0  -88.640000
8    Gangtok       5276.0   16.708333
9        Goa       6705.0    8.604651
12    Jaipur      10076.0  -17.113636
13   Kashmir      10829.0    0.163265
14    Kohima      11903.0    3.288889
16   Lucknow       5502.0    4.105263
18     Patna      12943.0   -5.177419
20     Simla       8666.0   22.620690
21     Surat       6828.0   53.800000
23   Udaipur      11073.0   67.000000

#### We can categorize disparities in sales or profitability based on following factors
#### Cities  with high-sales & low-profits(eg Ahmedabad , Hyderabad,  Patna)
#### Cities  with low-sales & low-profits (Chennai , Jaipur , Goa)

#### Cities with low-sales & high-profits might be overelying on discounts most of the time that increase sale but not profit. So in this case it is better to set right pricing strategies. 
#### Cities  with low-sales & low-profit might occur in those areas where there is poor local demand , so to overcome this right marketing strategies and better customer engagement might be needed.